In [ ]:
#Write a Python program to create and display a one-dimensional array-like object containing an array of data using Pandas module.

In [1]:
import pandas as pd
import numpy as np

In [2]:
city=['Bangalore','Mumbai','Kolkata','Delhi','Chennai']
df=pd.Series(city)
df

0    Bangalore
1       Mumbai
2      Kolkata
3        Delhi
4      Chennai
dtype: object

In [ ]:
# Write a Python program to convert a Panda module Series to Python list and its type

In [4]:
city=['Bangalore','Mumbai','Kolkata','Delhi','Chennai']
df=pd.Series(city)
lst=list(df)
print(lst)
type(lst)

['Bangalore', 'Mumbai', 'Kolkata', 'Delhi', 'Chennai']

list

In [ ]:
#Write a Python program to add, subtract, multiple and divide two Pandas Series.

In [8]:
num_1=[1,3,5,7,9]
num_2=[2,4,6,8,10]
df1=pd.Series(num_1)
df2=pd.Series(num_2)
df3_add=df1+df2
df3_sub=df1-df2
df3_mul=df1*df2
df3_div=df1/df2
print(df3_add)
print(df3_sub)
print(df3_mul)
print(df3_div)

0     3
1     7
2    11
3    15
4    19
dtype: int64
0   -1
1   -1
2   -1
3   -1
4   -1
dtype: int64
0     2
1    12
2    30
3    56
4    90
dtype: int64
0    0.500000
1    0.750000
2    0.833333
3    0.875000
4    0.900000
dtype: float64

In [ ]:
#Write a Python program to compare the elements of the two Pandas Series.

In [9]:
num_1=[2,3,6,9,10]
num_2=[2,4,5,9,1]
df1=pd.Series(num_1)
df2=pd.Series(num_2)
print(df1>df2)

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [ ]:
#Write a Python program to create and display a Data Frame from a specified dictionary data which has the index labels

In [16]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
#Write a Python program to select the specified columns (score and attempts) and rows(1,3,5,6) from a given Data Frame

In [27]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,labels)
df[['score','attempts']]
df.iloc[[1,3,5,6]]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes
g  Matthew   14.5         1     yes

In [ ]:
#Write a Python program to select the rows the score is between 15 and 20 (inclusive)

In [45]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,labels)
lst=df.loc[((df.score >=15) & (df.score<=20))]
lst

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [ ]:
#Write a Python program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.Â¶

In [46]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,labels)
lst=df.loc[((df.attempts<2) & (df.score>15))]
lst

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [ ]:
#Write a Python program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order.

In [65]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,labels)
data_1=df.sort_values(by=['name'],ascending=False)
data_2=df.sort_values(by=['score'],ascending=True)
print(data_1)
print('\n')
print(data_2)

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes


        name  score  attempts qualify
i      Kevin    8.0         2      no
b       Dima    9.0         3      no
e      Emily    9.0         2      no
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes
d      James    NaN         3      no
h      Laura    NaN         1      no

In [ ]:
#Write a Python program to insert a new column in existing Data Frame.

In [66]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,labels)
df['student_city']='Bangalore'
df

        name  score  attempts qualify student_city
a  Anastasia   12.5         1     yes    Bangalore
b       Dima    9.0         3      no    Bangalore
c  Katherine   16.5         2     yes    Bangalore
d      James    NaN         3      no    Bangalore
e      Emily    9.0         2      no    Bangalore
f    Michael   20.0         3     yes    Bangalore
g    Matthew   14.5         1     yes    Bangalore
h      Laura    NaN         1      no    Bangalore
i      Kevin    8.0         2      no    Bangalore
j      Jonas   19.0         1     yes    Bangalore

In [ ]:
#Write a Python program to change the name 'James' to 'Suresh' in name column of the data frame

In [87]:
df.at['d','name']='Suresh'
df

        name  score  attempts qualify student_city
a  Anastasia   12.5       1.0     yes    Bangalore
b       Dima    9.0       3.0      no    Bangalore
c  Katherine   16.5       2.0     yes    Bangalore
d     Suresh    NaN       3.0      no    Bangalore
e      Emily    9.0       2.0      no    Bangalore
f    Michael   20.0       3.0     yes    Bangalore
g    Matthew   14.5       1.0     yes    Bangalore
h      Laura    NaN       1.0      no    Bangalore
i      Kevin    8.0       2.0      no    Bangalore
j      Jonas   19.0       1.0     yes    Bangalore